{
  "ok": true,
  "instanceId": 5006,
  "account": "KAF55482274",
  "instructions": {
    "Instructions": "# Moving up in the world!\n\n**Reminder: These instructions are always available under the Instructions tab if you need to see them again.** \n\nAfter your impressive performance at your last job, you've moved on to Keating \u0026 Forbes.  Warning: **the gloves are off, now**.\nHere is **account KAF55482274** and a mandate from one of our clients, a pension fund: they want you to purchase them 100,000 shares of \nOceanStream Corp. (*OSC*).  (Their asset manager thinks the company will have market-beating performance over the next\nfew years.  Maybe they're right, maybe they're not, but either way we get paid and I'm investing my bonus in cat food futures.)\n\nThis is called a **block trade** -- 100,000 shares is a lot of OSC to buy all at once, so the presence of someone wanting to\ndo it suggests that someone who is smart and rich has better-than-market information about the stock.  Executing block trades\nis one of the core problems of trading.\n\nWhy?  Here's one of the reasons we on the sell-side make the big bucks: the client could try to buy these shares themselves,\n but if they just did the obvious thing and put in an order for 100,000 shares, they'd get shellacked.\n\nWhy?  Supply and demand: sudden demand for a product with limited supply, like liquid shares of a stock, makes the market \nclearing price go up.  Also, supply and demand: if you supply a sucker who broadcasts his intentions loudly, capitalism demands that the rest of\nthe market eat the sucker alive.  So instead you've got to be sneaky-sneaky about how you accumulate those 100,000 shares.\n\nLuckily, this market maker is dumb as a box of rocks.  They don't seem to remember prior orders well at all.  You could probably \nget the full allocation done just by calling them up all day and ordering a few shares here and a few shares there... \nbut I hear you're a programmer, and the stock exchange has [an API](https://starfighter.readme.io), so why do anything \nmanual and repetitive when you have a for loop available?\n\n## Your Goal\n* Purchase 100,000 shares of OSC.\n* Avoid causing a \"price impact\" -- our client wants these shares for the cheapest price possible, naturally.\n\n## You'll Be Fired If\n\n* You cause an excessive price impact in the stock.  What's \"excessive\"?  It's up to the risk desk.  \n* You take too long.  The client doesn't need their shares *this instant* but they want them *quickly*.\n* The market moves against you.  What, that's unfair?  Welcome to Wall Street, kid.\n\n### A Note From Starfighter:\n\nWe abstract the notion of time in Stockfighter.  On this level, one trading day in the simulated world corresponds to about five\nseconds of wall-clock time.  In real life, the market generally has off periods between trading days, but most of our levels don't --\nour bots don't need sleep.  Well, OK, technically speaking they do sleep() while waiting on you... like right now, because you're\nreading while you could be trading.  Get coding!\n",
    "Market Makers": "A **market maker** is a market participant (sometimes a formal role, often not) who provides *liquidity* in a stock, by being willing\nto buy the stock or sell the stock, substantially all of the time.  The market maker seeks to make a small amount of money on\na large amount of transactions by, on average, selling for slightly more than their buying price.  The difference between the price\nthat they're willing to buy at and the price that they're willing to sell at (at any given moment) is called \"the *spread*\".\n\nMarket makers are crucial to the financial markets.  A market without liquidity is a sucky market.  The market for houses has very\nlow liquidity: if you want to sell your house on Tuesday, it is unlikely that anyone wants to buy *exactly* your house on *exactly*\nTuesday, so you'd probably get a very, very poor price for it.  Similarly, if you wanted to buy *exactly* your dream house on *exactly*\nTuesday, you'd probably have to pay a ridiculous premium to the \"fair value\" of the house.\n\nImagine a world where there was someone you would call, name any address in the country, and immediately receive a buying\nprice and a selling price for that house.  That person would be a market maker.  They would make it much, much less difficult\nfor you to get into or out of your desired exposure to a house on Tuesday.\n\nMarket makers are the counter-parties to *most* transactions on the stock exchange.  That sounds unlikely, but it is true: it is\nhighly unlikely that a pension fund seeking to unload 100,000 shares of Google executes that trade at *the exact instant* where\na stadium full of mom-and-pop investors are seeking to buy 2~5 shares of Google apiece.\n\n## What Do Market Makers Not Like?\n\nMarket makers don't like **inventory risk**.  They get paid to take on a small, short-term risk of being long (holding stock) or \nshort (borrowing stock) in the stock they're making a market for, with the intention of quickly having an order in the opposite\ndirection get them out of that position.\n\nIt is dangerous for a market maker to trade with *informed order flow*, i.e. someone with better-than-market understanding of\nthe near term future for a stock.  Someone who is trading a block (a lot of stock at once) is automatically informed order flow,\nsince they know that their current transaction for buying 100 shares is going to be followed not by a 50/50 chance of a sell but\nrather with a buy, a buy, another buy, some more buys, followed by more buying.\n\nIf a market maker continues to allow informed order flow to trade with them, they may find themselves with a larger position than\nthey anticipated at a price which is expensive to get out of, given the present state of the market.\n\n## How Do Market Makers Deal With This?\n\n1. *Profile incoming orders.*  Market makers, beginning with humans with \"a sense of the flow of the market\" and continuing to\nHFT algorithms in the present day, are in a constant cat-and-mouse game with informed order flow.  They'd prefer to transact\nminimally (if at all) with informed orders.\n\n2.  *Hedge.*  More sophisticated strategies are available after a market maker has multiple instruments they can trade in.  For\nexample, they can hedge a long position in a stock with options which synthetially cancel out some features of the position.\nThey could also e.g. hedge a position in a particular stock with an offsetting position in a separate stock believe to be highly\ncorrelated with the original stock (e.g. if you're long Toyota, sell Honda), with indexes/exchange traded funds, or with other\nderivatives.\n\n## How Do I Make Markets?\n\nBuy low.  Sell high.  Trade frequently.\n\n## No, Really?\n\nObserve what the provided market makers do, in particular how they quote spreads and periodically cancel orders when\nthe market moves in either direction.  The provided market makers are as unsophisticated as they can be and possibly work\n(n.b. under 100 lines of Ruby code).  You should be able to easily exploit their blind spots.  \n\nA freebie, since **people who\nactually read docs should be rewarded**: our least sophisticated market maker has no memory of closed orders and looks\nat the order book every N seconds as if the universe had just sprung into being.  That probably suggests at least one way\nto trick it into doing what you want.  \n\nBonus points: if what you do to get what you want doesn't leave a signature in the order\nbook, it will *never* catch on.  (Note that a dumb market maker with smart participants next to it can function as a smart system\neven if they're not intentionally colluding, however.  One of the core insights of markets in general is that they quickly converge\non solutions which are better than individual participants would have come up with.  A market maker can surf on the market,\nwhich converges to a solution to your manipulation, without itself understanding that your manipulation even exists.)\n\nIn general, you want to \n\n1. quote a tighter spread (if the bot would quote $10 / $10.50, and you quote $10.05 / $10.45, you'll\nget the fills rather than the bot)\n2. attempt to profile incoming orders, for example by keeping state of your own recent orders and whether you appear to be\nhaving many similar ones happen in the same direction\n3. cancel and re-file your bids/asks when you develop inventory in either direction, potentially at a less favorable price if you're\nscared\n4. look for patterns in the market and in behavior of other participants.  Patterns which suggest anomalous behavior, which\nroutinely divulge that an order is from a sophisticated or unsophisticated source, or which allow you to predict the near-term\nbehavior of another participant are *very valuable indeed.*\n\n## Stockfighter Notes\n\nTake a look at the API docs for viewing an order's fills or the details of an execution.  Note that we don't expose any identifying\ninformation about your counterparty.  Now, try to think of creative ways that one can \"cheat\" the non-availability of that information.\n"
  },
  "tickers": [
    "OSC"
  ],
  "venues": [
    "RVOEX"
  ],
  "secondsPerTradingDay": 5
}